src/cfe/InformationRegisters/кб99_КодыРегионаПоИндексу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>кб99_КодыРегионаПоИндексу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кб99_КодыРегионаПоИндексу/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьЗаписиВРегистр()
	
	ТекстовыйФайл = ПолучитьИмяВременногоФайла("csv");
	
	МакетФайла = РегистрыСведений.кб99_КодыРегионаПоИндексу.ПолучитьМакет("кб99_ЕИС_КодыРегионаПоИндексу");
	МакетФайла.Записать(ТекстовыйФайл);

	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ТекстовыйФайл);
	Разделитель = ";";
	
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
				
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = ГМ_ЕИС.СтрРазделить82(Строка, Разделитель);
				
		Индексы = ГМ_ЕИС.СтрРазделить82(МассивКолонок[3], ",");
		КодыРегионов = ГМ_ЕИС.СтрРазделить82(МассивКолонок[2], ",");
		Для Каждого Инд Из Индексы Цикл
			Запись = РегистрыСведений.кб99_КодыРегионаПоИндексу.СоздатьМенеджерЗаписи();
		    Запись.Индекс = Инд;
			Запись.НаименованиеРегиона = МассивКолонок[0];
			Запись.КодРегиона = КодыРегионов[0];
			Запись.Записать(Истина);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)

	ДобавитьЗаписиВРегистр();
	Элементы.Список.Обновить();
	
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры
